<?php
    class Info {
        public const TABLE = 'info';
        public const ID = 'id';
        public const TITLE = 'title';
        public const DESCRIPTION = 'description';
        public const IMAGE_PATH = 'image_path';
        public const CREATED_AT = 'created_at';
        public const DETAILS = 'details_link';

        public static function getSQLString(): string
        {
            $tableName = self::TABLE;
            $id = self::ID;
            $title = self::TITLE;
            $description = self::DESCRIPTION;
            $imagePath = self::IMAGE_PATH;
            $createdAt = self::CREATED_AT;
            $detailsLink = self::DETAILS;

            return "CREATE TABLE IF NOT EXISTS $tableName (
                $id INT(11) NOT NULL AUTO_INCREMENT PRIMARY KEY,
                $title VARCHAR(255) NOT NULL,
                $description TEXT NOT NULL,
                $detailsLink VARCHAR(255) NOT NULL,
                $imagePath VARCHAR(255) NOT NULL,
                $createdAt TIMESTAMP DEFAULT CURRENT_TIMESTAMP
            )";
        }
        
        public static function defaultInsert(): string
        {
            $tableName = self::TABLE;
            $title = self::TITLE;
            $description = self::DESCRIPTION;
            $imagePath = self::IMAGE_PATH;
            $detailsLink = self::DETAILS;

            return "INSERT INTO $tableName ($title,$description,$detailsLink,$imagePath)
            VALUES('Важлива інформація для вступників та керівників закладів освіти','Шановні друзі, війна змінила наші життя, і певні події складно планувати. Однак якщо ви цього року розглядаєте можливість вступати до закладів вищої освіти України (бакалаврський ступінь), будь ласка, ознайомтеся з інформацією, поданою за посиланням нижче.','https://testportal.gov.ua/vazhlyva-informatsiya-dlya-vstupnykiv-i-kerivnykiv-zakladiv-osvity/?fbclid=IwAR2ChpljgpnZL0HqsI2fOno8pX69BxB-MPcSXrJfA1vt90akpCK5tLuKO9Q','https://iasa.kpi.ua/asset/images/attention.png'),
            ('Розподіл додаткових балів','Список розподілу додаткових балів літо 2022 (2-ий семестр 2021/2022 н.р. 1-ий семестр 2021/2022 н.р.)','https://iasa.kpi.ua/asset/files/additional-marks/additional-marks-final-report-IASA-2021_2022-2sep.pdf','https://iasa.kpi.ua/asset/images/bonuses-300x198.jpg'),
            ('Порядок оформления контракних договорів','На протязі 10 робочих днів потрібно під`їхати в 35 корпус КПІ,кімната 203, з 11-00 до 17-00 для укладння контракту. На підписанні повинен бути здобувач освіти та його представник, в разі якщо здобувачу менше 18 років. P документів потрібно мати паспорт та ідентифікаційний код здобувачу та представнику.','#','https://iasa.kpi.ua/asset/images/gabrielle-unsplash.jpg'),
            ('Відкритий конкурс на міжнародні наукові стажування для студентів ІПСА','Наразі відкриті 9 вакансій для наукових стажувань наших студентів у французьких лабораторіях Loria (University of Lorraine & Jean Lamour Institute). Ви можете подати заявку до 1 грудня! За програмою запропонована заробітна плата (550 євро/місяць), яка може бути доповнена грантом Erasmus+. Термін стажування - 5-6 місяців (початок стажування лютий-березень 2022)','#','https://iasa.kpi.ua/asset/images/Internship_offers.jpg'),
            ('Курс .NET для студентів факультету ІПСА','Profile-me розробляє власний продукт для спрощення процесу найму працівників: структурує співбесіди, автоматизує рутинні задачі рекрутерів, тощо. Компанія розпочинає курс з .NET 5.0, з подальшим віддаленим працевлаштуванням найкращих слухачів.','https://iasa.kpi.ua/','https://iasa.kpi.ua/asset/images/Profile_logo.jpg'),
            ('Запрошуємо долучитись до серії відкритих лекцій про аналітику в продуктовому ІТ!','Лише для студентів ІПСА від випускників ІПСА: шлях від ІПСА до цікавих задач в продуктових топкомпаніях.
Про що поговоримо?
▫️хто такий аналітик у продуктовому ІТ
▫️як освоєні за роки навчання методи дослідження регулярно використовуються на практиці
▫️якимі метрики має розуміти кожен, хто планує почати шлях у аналітиці
Коли і де:
Де: корпус ІПСА (деталі буде уточнено і повідомлено)
Дати зустрічей: 06.06(ВТ), 08.06(ЧТ), 13.06(ВТ)
Час: 17:30
Формат: Offline first з можливістю online.
Зареєструватись (на усі події чи на кожну окремо)','https://iasa.kpi.ua/','https://iasa.kpi.ua/asset/images/attention.png'),
            ('💡 KPI school of creativity. Vol.4. Spring edition','☝️ Тема четвертої Школи креативності: «Штучний інтелект — технологічна революція сучасності». Дізнаєтеся про науково-інноваційний прогрес технології штучного інтелекту та можливість розвитку в цій галузі.
🧑 Спікери школи — фахівці галузі ШІ з КПІ, компаній, державних структур. Беручи участь у школі, ви отримаєте знання, які стануть фундаментом для подальшої діяльності у проєктній сфері, використовуючи технології ШІ.
🎉 KPI school of creativity дозволить вам:
• ознайомитися з останніми науковими/комерційними досягненнями в сфері штучного інтелекту;
• розвинути креативне мислення для подальшої студентської проєктної діяльності;
• ознайомитися з практичними прикладами застосування штучного інтелекту в різних сферах;
• навчитися формувати командну співпрацю і розвивати проєктний менеджмент;
• використовувати інтерактивні методи навчання;
• і, звісно ж, сертифікат учасника.
📝 Якщо ви вважаєте, що ШІ може знадобитись у вашій діяльності – вам потрібно лише зареєструватися у   формі. Кількість місць обмежена, чекаємо на вашу мотивацію 😉
📌 Проєкт ініційований ГО Студентський парламент КПІ ім. Ігоря Сікорського за підтримки адміністрації та Noosphere Engineering School.
🕓 Коли:
• дедлайн реєстрації 21 травня о 23:59;
• школа 23-26 травня 2023.
📍 Де:   Світовий центр даних з геоінформатики та сталого розвитку. У разі повітряної тривоги, поруч з будівлею є укриття.
💭 Хочеш організувати захід або проанонсувати подію? Пиши в бот @VORS_team_bot Відділу організаційно-виховної роботи зі студентами. Успіхів!','https://iasa.kpi.ua/','https://iasa.kpi.ua/asset/images/attention.png'),
            ('Шановні студенти, відкрито набір на програму стажування в компанію Melexis!','На стажуванні учасники будуть створювати аналогові мікросхеми в Cadence Virtuoso, вдосконалять навички в мікроелектронній схемотехніці, будуть працювати з найсучаснішим вимірювальним обладнанням, користуватися LabVIEW/Python для автоматизації вимірювань, розробляти друковані плати в Altium Designer, програмувати на С/ASM.
Можливі наступні напрямки стажування:
Associate Analog Design Engineer
Associate Test Solution Development Engineer
Етапи:
Pаповнити анкету за посиланням
інтерв’ю та відбір (травень 2023)
літня практика тривалістю 2 місяці (починаючи з липня 2023)
Відвідування офісу або заняття у спільній науково-освітній лабораторі КПІ-Мелексіс
У разі питань звертатись до Приходько Ольги – HR manager: +38050-457-03-25, opr@melexis.com','https://iasa.kpi.ua/','https://iasa.kpi.ua/asset/images/attention.png'),
            ('НН ІПСА запршує прийняти участь в зустрічі
День відритих дверей','Час: 15 травня 2023 19:00
Идентификатор конференции: 847 9083 3292
Код доступа: 898459

12 травня 2023 року 11:30 – 12:10','https://iasa.kpi.ua/','https://iasa.kpi.ua/asset/images/attention.png')
            ;";
        }
    }
?>
