<!DOCTYPE html>
<html>
    <head>
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge">
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <title>Університет</title>
        <link rel="stylesheet" type="text/css" href="style.css">
    </head>
    <body>
        <header>
            <a href="#">
                <svg class="lnr lnr-graduation-hat">
                    <symbol id="lnr-graduation-hat" viewBox="0 0 1024 1024">
                        <path class="path1" d="M955.296 359.714l-460.8-153.6c-5.254-1.752-10.936-1.752-16.19 0l-460.8 153.6c-10.454 3.485-17.506 13.267-17.506 24.286s7.051 20.802 17.504 24.286l136.096 45.365v135.149c0 6.789 2.698 13.301 7.499 18.101 4.486 4.488 112.346 109.899 325.301 109.899 77.454 0 149.712-13.941 214.766-41.434 13.024-5.504 19.118-20.523 13.616-33.547-5.504-13.024-20.525-19.117-33.547-13.616-58.714 24.816-124.266 37.397-194.835 37.397-99.586 0-172.84-25.781-216.758-47.41-32.53-16.019-54.259-32.203-64.842-40.926v-106.547l273.504 91.168c2.627 0.877 5.362 1.314 8.096 1.314s5.467-0.437 8.096-1.314l273.504-91.168v45.686c-29.797 10.568-51.2 39.024-51.2 72.397 0 31.269 18.792 58.213 45.666 70.181l-44.901 179.61c-1.91 7.648-0.194 15.75 4.658 21.965s12.294 9.845 20.178 9.845h102.4c7.883 0 15.326-3.632 20.178-9.845s6.568-14.315 4.658-21.965l-44.901-179.61c26.874-11.968 45.666-38.912 45.666-70.181 0-33.373-21.403-61.829-51.2-72.397v-62.752l136.096-45.366c10.453-3.483 17.504-13.266 17.504-24.285s-7.051-20.802-17.504-24.286zM793.6 563.2c14.115 0 25.6 11.485 25.6 25.6s-11.485 25.6-25.6 25.6-25.6-11.485-25.6-25.6 11.485-25.6 25.6-25.6zM775.187 819.2l18.413-73.648 18.413 73.648h-36.826zM791.536 408.902l-300.928-50.155c-13.952-2.322-27.136 7.099-29.461 21.042-2.325 13.947 7.098 27.138 21.043 29.461l205.533 34.256-201.323 67.11-379.846-126.616 379.846-126.616 379.845 126.616-74.709 24.902z">
                        </path>
                    </symbol>
                    <use xlink:href="#lnr-graduation-hat"></use>
                </svg>
            </a>
            <form action="#" method="get">
                <input type="text" name="search" placeholder="Пошук">
                <button type="submit">
                    <svg class="lnr lnr-magnifier">
                        <symbol id="lnr-magnifier" viewBox="0 0 1024 1024"><path class="path1" d="M966.070 981.101l-304.302-331.965c68.573-71.754 106.232-165.549 106.232-265.136 0-102.57-39.942-199-112.47-271.53s-168.96-112.47-271.53-112.47-199 39.942-271.53 112.47-112.47 168.96-112.47 271.53 39.942 199.002 112.47 271.53 168.96 112.47 271.53 112.47c88.362 0 172.152-29.667 240.043-84.248l304.285 331.947c5.050 5.507 11.954 8.301 18.878 8.301 6.179 0 12.378-2.226 17.293-6.728 10.421-9.555 11.126-25.749 1.571-36.171zM51.2 384c0-183.506 149.294-332.8 332.8-332.8s332.8 149.294 332.8 332.8-149.294 332.8-332.8 332.8-332.8-149.294-332.8-332.8z"></path></symbol>
                    <use xlink:href="#lnr-magnifier"></use>
                    </svg>
                </button>
            </form>            
            <nav>
                <ul>
                    <li><a href="#">Навчальна програма</a>
                        <ul>
                            <li><a href="http://mmsa.kpi.ua/">Кафедра ММСА</a></li>
                            <li><a href="https://cad.kpi.ua/">Кафедра СП</a></li>
                        </ul>
                    </li>
                    <li><a href="#">Вступ</a>
                        <ul>
                            <li><a href="https://iasa.kpi.ua/courses">Підготовчі курси</a></li>
                            <li><a href="https://iasa.kpi.ua/bachelor-admission">Бакалавр</a></li>
                            <li><a href="https://iasa.kpi.ua/master-admission">Магістр</a></li>
                            <li><a href="https://iasa.kpi.ua/phd-admission">Аспірантура</a></li>
                        </ul>
                    </li>
                    <li><a href="#">Наука</a>
                        <ul>
                            <li><a href="info/scienceDirection.html">Напрями</a></li>
                            <li><a href="info/iasaJournal.html">Наукові видання</a></li>
                        </ul>
                    </li>
                    <li><a href="#">Про нас</a>
                        <ul>
                            <li><a href="https://schedule.kpi.ua/">Розклад</a></li>
                            <li><a href="https://iasa.kpi.ua/contacts">Контакти</a></li>
                        </ul>
                    </li>
                </ul>
            </nav>
        </header>
        <main>
            <section class="intro">
                <ul class="intro-list">
                    <li>
                        <a href="https://iasa.kpi.ua/bachelor-admission" class="btn">Вступ</a>
                    </li>
                    <li>
                        <a href="#news" class="btn">Новини</a>
                    </li>
                </ul>
            </section>
            <section class="news" id="news">
                <div class="container">
                    <h2>Новини</h2>
                    <ul class="news-list">
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/attention.png" alt="новина 1">
                            <div>
                                <h3>
                                    <a href="https://testportal.gov.ua/vazhlyva-informatsiya-dlya-vstupnykiv-i-kerivnykiv-zakladiv-osvity/?fbclid=IwAR2ChpljgpnZL0HqsI2fOno8pX69BxB-MPcSXrJfA1vt90akpCK5tLuKO9Q">
                                        Важлива інформація для вступників та керівників закладів освіти
                                    </a>
                                </h3>
                                <p>
                                    Шановні друзі, війна змінила наші життя, і певні події складно планувати. 
                                    Однак якщо ви цього року розглядаєте можливість вступати до закладів вищої освіти України (бакалаврський ступінь), 
                                    будь ласка, ознайомтеся з інформацією, поданою за посиланням нижче.
                                </p>
                            </div>
                        </li>
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/bonuses-300x198.jpg" alt="новина 2">
                            <div>
                                <h3>
                                    <a href="https://iasa.kpi.ua/asset/files/additional-marks/additional-marks-final-report-IASA-2021_2022-2sep.pdf">
                                        Розподіл додаткових балів
                                    </a>
                                </h3>
                                <p>Список розподілу додаткових балів літо 2022 (2-ий семестр 2021/2022 н.р. 1-ий семестр 2021/2022 н.р.)</p>
                            </div>
                        </li>
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/gabrielle-unsplash.jpg" alt="новина 3">
                            <div>
                                <h3>Порядок оформления контракних договорів</h3>
                            <p> 
                                На протязі 10 робочих днів потрібно під'їхати в 35 корпус КПІ, 
                                кімната 203, з 11-00 до 17-00 для укладння контракту. 
                                На підписанні повинен бути здобувач освіти та його представник, в разі якщо здобувачу менше 18 років. 
                                P документів потрібно мати паспорт та ідентифікаційний код здобувачу та представнику.
                            </p>
                            </div>
                        </li>
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/EPAM-day.png" alt="івент 1">
                            <div>
                            <h3><a href="https://www.facebook.com/events/661037755339632">EPAM Open Day Online</a></h3>
                            <p>Онлайн – не привід не спілкуватися з командою ЕРАМ University! Запрошуємо всіх на довгоочікуваний EPAM Open Day Online💥</p>
                            </div>
                        </li>
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/Internship_offers.jpg" alt="івент 2">
                            <div>
                            <h3><a href="#">Відкритий конкурс на міжнародні наукові стажування для студентів ІПСА</a></h3>
                            <p>Наразі відкриті 9 вакансій для наукових стажувань наших студентів у французьких лабораторіях Loria (University of Lorraine & Jean Lamour Institute). Ви можете подати заявку до 1 грудня! За програмою запропонована заробітна плата (550 євро/місяць), яка може бути доповнена грантом Erasmus+. Термін стажування - 5-6 місяців (початок стажування лютий-березень 2022).</p>
                            </div>
                        </li>
                        <li>
                            <img src="https://iasa.kpi.ua/asset/images/Profile_logo.jpg" alt="івент 3">
                            <div>
                            <h3><a href="https://iasa.kpi.ua/">Курс .NET для студентів факультету ІПСА</a></h3>
                            <p>Profile-me розробляє власний продукт для спрощення процесу найму працівників: структурує співбесіди, автоматизує рутинні задачі рекрутерів, тощо. Компанія розпочинає курс з .NET 5.0, з подальшим віддаленим працевлаштуванням найкращих слухачів.</p>
                            </div>
                        </li>
                    </ul>
                    <h3><a href="form.html">Запропонувати новину</a></h3>
                </div>
            </section>
        </main>
        <footer>
            <ul class="tel">
                <li><a href="ipsa@kpi.ua">ipsa@kpi.ua</a></li>
                <li><a href="+38 (044) 280-87-71">+38 (044) 280-87-71</a></li>
                <li><a href="+38 (044) 280-87-71">+38 (044) 280-87-71</a></li>
              </ul>
              <p>Слідкуйте за нами в соціальних мережах:</p>
              <ul class="social-links">
                <li><a href="https://www.linkedin.com/company/iasakpi/about/">linkedin</a></li>
                <li><a href="https://www.facebook.com/ipsa.kpi/">facebook</a></li>
                <li><a href="https://t.me/dekanat_ipsa">telegram</a></li>
              </ul>
        </footer>
    </body>
</html>